ЕРПУХАстенд.cbr_Основной/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8eac9a31-ed8b-4965-85f9-086b89e1764b">
  <name>РеализацияТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.cbr_ОплатаОтгрузкаПоМенеджерам</registerRecords>
  <tabularSections>
    <name>cbr_ТЧПересечениеМенеджеров</name>
    <comment>//++ БаженоваЕО 27.01.2026 ПРД.18</comment>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="8139626e-8ad5-43ef-8108-a207607b40b5">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>cbr_ЦенаСоСкидкой</name>
      <comment>//cbr-larkovgeorg 17.02.2026 ПРД24</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/Documents/РеализацияТоваровУслуг/Forms/ФормаДокумента/Module.bsl
#Область СлужебныеПроцедурыИФункции

//++ БаженоваЕО 02.02.2026 ПРД.18
&НаКлиенте
Процедура cbr_ТЧПересечениеМенеджеровПроцентПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.cbr_ТЧПересечениеМенеджеров.ТекущиеДанные;
	
	Если ТекущаяСтрока.Процент > 100 Тогда
		ТекущаяСтрока.Процент = 100;
	КонецЕсли;
	
КонецПроцедуры //-- БаженоваЕО 02.02.2026

&НаКлиенте
Процедура ТоварыЦенаСоСкидкойПриИзменении(Элемент)
	//++ cbr-larkovgeorg 17.02.2026 ПРД24 
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	СуммаСкидки = ТекущаяСтрока.Цена - ТекущаяСтрока.cbr_ЦенаСоСкидкой;
	Если ТекущаяСтрока.Цена <> 0 Тогда
		ТекущаяСтрока.ПроцентРучнойСкидки = (СуммаСкидки / ТекущаяСтрока.Цена) * 100;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.cbr_ЦенаСоСкидкой) И ТекущаяСтрока.Сумма <> ТекущаяСтрока.cbr_ЦенаСоСкидкой * ТекущаяСтрока.КоличествоУпаковок Тогда

		ТекущаяСтрока.Сумма = ТекущаяСтрока.cbr_ЦенаСоСкидкой * ТекущаяСтрока.КоличествоУпаковок;
		
	КонецЕсли;
	
	ТоварыСуммаПриИзменении(Элемент);

КонецПроцедуры //-- cbr-larkovgeorg 17.02.2026 ПРД24

&ИзменениеИКонтроль("РассчитатьИтоговыеПоказатели")
&НаКлиентеНаСервереБезКонтекста
Процедура cbr_РассчитатьИтоговыеПоказатели(Форма)

	// Заполнение итогов по таблице "Товары"
	КоллекцияТовары = Форма.Объект.Товары;

	Форма.СуммаВсего = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаСНДС"),
		КоллекцияТовары.Итог("СуммаСНДСБезВозвратнойТары"));
	Форма.СуммаНДС = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаНДС"),
		КоллекцияТовары.Итог("СуммаНДСБезВозвратнойТары"));

	СуммаАвтоСкидки = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаАвтоматическойСкидки"),
		КоллекцияТовары.Итог("СуммаАвтоматическойСкидкиБезВозвратнойТары"));
	СуммаРучнойСкидки = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаРучнойСкидки"),
		КоллекцияТовары.Итог("СуммаРучнойСкидкиБезВозвратнойТары"));
	СуммаСуммаБонусныхБалловКСписаниюВВалюте = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаБонусныхБалловКСписаниюВВалюте"),
		КоллекцияТовары.Итог("СуммаБонусныхБалловКСписаниюВВалютеБезВозвратнойТары"));
	Форма.СуммаСкидки = СуммаАвтоСкидки + СуммаРучнойСкидки + СуммаСуммаБонусныхБалловКСписаниюВВалюте;

	Форма.СуммаЗалогаЗаТару = ?(Форма.Объект.ТребуетсяЗалогЗаТару, КоллекцияТовары.Итог("СуммаСНДС")
			-КоллекцияТовары.Итог("СуммаСНДСБезВозвратнойТары"),0);

	Если УчетНДСУПКлиентСервер.ОтображатьНДСВИтогахДокументаПродажи(Форма.Объект.НалогообложениеНДС) Тогда
		Форма.Элементы.ГруппаСтраницыВсего.ТекущаяСтраница = Форма.Элементы.СтраницаВсегоСНДС;
		Форма.Элементы.ГруппаСтраницыНДС.ТекущаяСтраница = Форма.Элементы.СтраницаСНДС;
	Иначе
		Форма.Элементы.ГруппаСтраницыВсего.ТекущаяСтраница = Форма.Элементы.СтраницаВсегоБезНДС;
		Форма.Элементы.ГруппаСтраницыНДС.ТекущаяСтраница = Форма.Элементы.СтраницаБезНДС;
	КонецЕсли;
	#Вставка
	//++ cbr-larkovgeorg 17.02.2026 ПРД24 
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Элементы, "ТоварыЦенаСоСкидкой") Тогда
		Для Каждого Стр Из КоллекцияТовары Цикл
			Если Стр.КоличествоУпаковок <> 0 И Стр.Сумма <> 0 Тогда
				Стр.cbr_ЦенаСоСкидкой = Стр.Сумма / Стр.КоличествоУпаковок;		
			КонецЕсли;
		КонецЦикла
	КонецЕсли;
	//-- cbr-larkovgeorg 17.02.2026 ПРД24 
	#КонецВставки

КонецПроцедуры
#КонецОбласти
